package com.example.speak_caucasus.domain.learning.study_plan.impl

import com.example.speak_caucasus.R
import com.example.speak_caucasus.domain.learning.models.Lesson
import com.example.speak_caucasus.domain.learning.study_plan.StudyPlanInteractor

class StudyPlanInteractorImpl: StudyPlanInteractor {
    override fun getLessons(): List<Lesson> {
        return listOf(
            Lesson(
                id = 1,
                title = "Чеченская азбука",
                lessonsAmount = 1,
                newWordsAmount = 1,
                pic = "https://avatars.mds.yandex.net/i?id=6afce95cac42f4e253d6f833d73db21e9ae8547b-4936691-images-thumbs&n=13",
                text = "Можно поздравить вас: из 35 согласных фонем вы уже знаете 29. \n" +
                        "Теперь о некоторых\n" +
                        "специфических согласных фонемах, передаваемых через сочетание букв. Их называют смычно-гортанными или надгортанными,\n" +
                        " потому что при их произношении образуются две смычки в полости горла и в полости рта. ",
                lessonsList = emptyList()
            ),
            Lesson(
                id = 1,
                title = "Чеченская азбука",
                lessonsAmount = 1,
                newWordsAmount = 1,
                pic = "",
                text = "Можно поздравить вас: из 35 согласных фонем вы уже знаете 29. \n" +
                        "Теперь о некоторых\n" +
                        "специфических согласных фонемах, передаваемых через сочетание букв. Их называют смычно-гортанными или надгортанными,\n" +
                        " потому что при их произношении образуются две смычки в полости горла и в полости рта. ",
                lessonsList = emptyList()
            ),
            Lesson(
                id = 1,
                title = "Чеченская азбука",
                lessonsAmount = 1,
                newWordsAmount = 1,
                pic = "",
                text = "Можно поздравить вас: из 35 согласных фонем вы уже знаете 29. \n" +
                        "Теперь о некоторых\n" +
                        "специфических согласных фонемах, передаваемых через сочетание букв. Их называют смычно-гортанными или надгортанными,\n" +
                        " потому что при их произношении образуются две смычки в полости горла и в полости рта. ",
                lessonsList = emptyList()
            ),
            Lesson(
                id = 1,
                title = "Чеченская азбука",
                lessonsAmount = 1,
                newWordsAmount = 1,
                pic = "",
                text = "Можно поздравить вас: из 35 согласных фонем вы уже знаете 29. \n" +
                        "Теперь о некоторых\n" +
                        "специфических согласных фонемах, передаваемых через сочетание букв. Их называют смычно-гортанными или надгортанными,\n" +
                        " потому что при их произношении образуются две смычки в полости горла и в полости рта. ",
                lessonsList = emptyList()
            ),
            Lesson(
                id = 1,
                title = "Чеченская азбука",
                lessonsAmount = 1,
                newWordsAmount = 1,
                pic = "",
                text = "Можно поздравить вас: из 35 согласных фонем вы уже знаете 29. \n" +
                        "Теперь о некоторых\n" +
                        "специфических согласных фонемах, передаваемых через сочетание букв. Их называют смычно-гортанными или надгортанными,\n" +
                        " потому что при их произношении образуются две смычки в полости горла и в полости рта. ",
                lessonsList = emptyList()
            ),
            Lesson(
                id = 1,
                title = "Чеченская азбука",
                lessonsAmount = 1,
                newWordsAmount = 1,
                pic = "",
                text = "Можно поздравить вас: из 35 согласных фонем вы уже знаете 29. \n" +
                        "Теперь о некоторых\n" +
                        "специфических согласных фонемах, передаваемых через сочетание букв. Их называют смычно-гортанными или надгортанными,\n" +
                        " потому что при их произношении образуются две смычки в полости горла и в полости рта. ",
                lessonsList = emptyList()
            ),
            Lesson(
                id = 1,
                title = "Чеченская азбука",
                lessonsAmount = 1,
                newWordsAmount = 1,
                pic = "",
                text = "Можно поздравить вас: из 35 согласных фонем вы уже знаете 29. \n" +
                        "Теперь о некоторых\n" +
                        "специфических согласных фонемах, передаваемых через сочетание букв. Их называют смычно-гортанными или надгортанными,\n" +
                        " потому что при их произношении образуются две смычки в полости горла и в полости рта. ",
                lessonsList = emptyList()
            ),
            Lesson(
                id = 1,
                title = "Чеченская азбука",
                lessonsAmount = 1,
                newWordsAmount = 1,
                pic = "",
                text = "Можно поздравить вас: из 35 согласных фонем вы уже знаете 29. \n" +
                        "Теперь о некоторых\n" +
                        "специфических согласных фонемах, передаваемых через сочетание букв. Их называют смычно-гортанными или надгортанными,\n" +
                        " потому что при их произношении образуются две смычки в полости горла и в полости рта. ",
                lessonsList = emptyList()
            ),
            Lesson(
                id = 1,
                title = "Чеченская азбука",
                lessonsAmount = 1,
                newWordsAmount = 1,
                pic = "",
                text = "Можно поздравить вас: из 35 согласных фонем вы уже знаете 29. \n" +
                        "Теперь о некоторых\n" +
                        "специфических согласных фонемах, передаваемых через сочетание букв. Их называют смычно-гортанными или надгортанными,\n" +
                        " потому что при их произношении образуются две смычки в полости горла и в полости рта. ",
                lessonsList = emptyList()
            ),
            Lesson(
                id = 1,
                title = "Чеченская азбука",
                lessonsAmount = 1,
                newWordsAmount = 1,
                pic = "",
                text = "Можно поздравить вас: из 35 согласных фонем вы уже знаете 29. \n" +
                        "Теперь о некоторых\n" +
                        "специфических согласных фонемах, передаваемых через сочетание букв. Их называют смычно-гортанными или надгортанными,\n" +
                        " потому что при их произношении образуются две смычки в полости горла и в полости рта. ",
                lessonsList = emptyList()
            )
        )
    }

}